{
  "features": {
    "title": "Pourquoi Caro ?",
    "subtitle": "Un agent compagnon conçu pour la sécurité, l'empathie et l'expertise",
    "alphaNotice": "🚧 Alpha en Soft Launch — Nous construisons activement avec notre communauté. Rejoignez-nous pour façonner l'avenir de Caro !",
    "items": [
      {
        "icon": "🛡️",
        "title": "Gardien de Sécurité",
        "description": "Validation complète qui bloque les commandes dangereuses comme rm -rf /, les fork bombs et les opérations destructrices. 52 patterns de sécurité prédéfinis avec évaluation du niveau de risque.",
        "statusLabel": "Disponible"
      },
      {
        "icon": "🌍",
        "title": "Expert Multi-Plateformes",
        "description": "Fonctionne sur macOS, Linux, Windows, GNU et BSD. Comprend les nuances spécifiques à chaque plateforme et respecte votre distribution préférée.",
        "statusLabel": "Disponible"
      },
      {
        "icon": "🧠",
        "title": "Conscience des Plateformes",
        "description": "Fournit des recommandations basées sur les capacités de votre plateforme et les bonnes pratiques. Distingue automatiquement la syntaxe des commandes BSD et GNU.",
        "statusLabel": "Disponible"
      },
      {
        "icon": "✅",
        "title": "Spécialiste POSIX",
        "description": "Expert en commandes shell conformes POSIX qui fonctionnent de manière fiable sur tous les systèmes. Portable, sûr et optimisé pour votre terminal.",
        "statusLabel": "Disponible"
      },
      {
        "icon": "⚡",
        "title": "Ultra Rapide",
        "description": "Objectif : Démarrage en moins de 100ms, inférence en moins de 2s sur Apple Silicon. Intégration du framework MLX pour l'accélération GPU sur puces série M.",
        "statusLabel": "En Développement"
      },
      {
        "icon": "🤝",
        "title": "Compagnon de Claude",
        "description": "Vision : Intégration transparente avec Claude en tant que serveur MCP et Skill, déléguant l'inférence des commandes shell pendant que Claude se concentre sur votre travail global.",
        "statusLabel": "Prévu"
      }
    ]
  }
}
